{
  "schema": "apm2.ticket.v1",
  "ticket_meta": {
    "schema_version": "2026-01-29",
    "template_version": "2026-01-29",
    "ticket": {
      "id": "TCK-00389",
      "title": "Review receipt ingestion: daemon endpoint for external reviewer results",
      "status": "CLOSED"
    },
    "binds": {
      "prd_id": "PRD-0009",
      "rfc_id": "RFC-0018"
    },
    "custody": {
      "agent_roles": [
        "AGENT_IMPLEMENTER"
      ],
      "responsibility_domains": [
        "DOMAIN_RUNTIME",
        "DOMAIN_SECURITY"
      ]
    },
    "dependencies": {
      "tickets": [
        {
          "ticket_id": "TCK-00383",
          "reason": "CAS and ledger wiring must be operational for review artifact storage and event emission."
        },
        {
          "ticket_id": "TCK-00388",
          "reason": "Gate orchestrator issues gate leases that reviewers fulfill; ingestion validates against these leases."
        }
      ]
    },
    "scope": {
      "in_scope": [
        "Add IngestReviewReceipt message type to the operator socket protocol.",
        "Handler validates reviewer identity against the gate lease bound to the review.",
        "Handler validates review artifact bundle integrity via CAS hash verification.",
        "Handler creates signed ReviewReceiptRecorded or ReviewBlockedRecorded event.",
        "Handler emits event to ledger, triggering the projection worker for GitHub sync.",
        "Add OperatorClient::ingest_review_receipt method for CLI and agent callers.",
        "Add integration test validating receipt ingestion and ledger emission."
      ],
      "out_of_scope": [
        "Review execution logic (what the reviewer actually does during quality/security review).",
        "Projection to GitHub (already implemented in projection worker at crates/apm2-daemon/src/projection/worker.rs).",
        "xtask reviewer integration (xtask spawns reviewers, this ticket handles their results).",
        "Gate lease issuance (TCK-00388)."
      ]
    },
    "plan": {
      "steps": [
        "Define IngestReviewReceipt request/response message types in the operator protocol schema.",
        "Add protocol dispatch handler for IngestReviewReceipt in the daemon's protocol dispatcher.",
        "In the handler: look up the GateLeaseIssued event for the given lease_id from the ledger.",
        "Validate that the reviewer identity in the request matches the executor_actor_id bound in the lease.",
        "Validate that the review artifact bundle hash matches the CAS reference (fetch and verify).",
        "If review succeeded: create signed ReviewReceiptRecorded event with changeset_digest, bundle hash, and time envelope.",
        "If review blocked: create signed ReviewBlockedRecorded event with appropriate ReasonCode.",
        "Emit the event to the ledger via SqliteLedgerEventEmitter.",
        "Add OperatorClient::ingest_review_receipt method that sends IngestReviewReceipt and awaits response.",
        "Add integration test: issue a gate lease, submit a review receipt, verify ledger contains ReviewReceiptRecorded and projection worker picks it up."
      ]
    },
    "definition_of_done": {
      "criteria": [
        "IngestReviewReceipt message type exists in operator socket protocol.",
        "Reviewer identity is validated against the gate lease executor_actor_id.",
        "Review artifact bundle integrity is verified via CAS hash.",
        "ReviewReceiptRecorded event is emitted to ledger on successful review ingestion.",
        "ReviewBlockedRecorded event is emitted to ledger on blocked review ingestion.",
        "Projection worker picks up emitted events and projects to GitHub (existing behavior, verified in test).",
        "OperatorClient::ingest_review_receipt method works for CLI callers.",
        "Invalid reviewer identity is rejected with clear error.",
        "Duplicate receipt ingestion is idempotent (same receipt_id does not create duplicate events)."
      ]
    },
    "notes": {
      "context": "Currently, Gemini CLI review processes run externally (spawned by xtask/src/tasks/push.rs)\nand update GitHub statuses directly via the GitHub API, completely bypassing the FAC pipeline.\nThis means review results are not recorded in the ledger, not cryptographically signed, and\nnot bound to gate leases. The projection worker (crates/apm2-daemon/src/projection/worker.rs)\nalready tails the ledger for ReviewReceiptRecorded events and projects them to GitHub with\nstatus updates and comments - but nothing produces these events from external reviewer output.\n\nThe core types already exist:\n- ReviewReceiptRecorded (crates/apm2-core/src/fac/review_receipt.rs): captures changeset_digest,\n  CAS reference to ReviewArtifactBundleV1, HTF time envelope, domain-separated signature\n- ReviewBlockedRecorded (crates/apm2-core/src/fac/review_blocked.rs): captures reason code\n  (ApplyFailed, ToolFailed, etc.), blocked log CAS hash, time envelope\n- ReviewArtifactBundleV1: stores review text CAS hash, tool log CAS hashes, review metadata\n- The hef_fac_v0_e2e test (crates/apm2-daemon/tests/hef_fac_v0_e2e.rs) validates the full\n  review receipt flow end-to-end\n\nThe OperatorClient (crates/apm2-cli/src/client/protocol.rs line 280) already provides methods\nlike claim_work, spawn_episode, work_status. Adding ingest_review_receipt follows the same\npattern: define message, add dispatcher handler, add client method.\n\nThis ticket bridges the gap between external gate executors and the FAC ledger. Once reviewers\ncan submit results through the daemon, the projection worker handles GitHub synchronization\nautomatically, and the merge executor (TCK-00390) can observe all gates passing.\n",
      "files": "- crates/apm2-core/src/fac/review_receipt.rs (ReviewReceiptRecorded, ReviewArtifactBundleV1, ReviewVerdict)\n- crates/apm2-core/src/fac/review_blocked.rs (ReviewBlockedRecorded, ReasonCode)\n- crates/apm2-daemon/src/projection/worker.rs (tails ledger for ReviewReceiptRecorded, projects to GitHub)\n- crates/apm2-daemon/src/protocol/ (operator socket protocol dispatchers)\n- crates/apm2-cli/src/client/protocol.rs (OperatorClient at line 280, add ingest_review_receipt)\n- crates/apm2-daemon/tests/hef_fac_v0_e2e.rs (existing e2e test for review receipt flow)\n- crates/apm2-daemon/src/ledger.rs (SqliteLedgerEventEmitter for event emission)\n",
      "security": "Reviewer identity validation is security-critical: a review receipt from an unauthorized\nentity must be rejected. The handler MUST verify that the submitting actor matches the\nexecutor_actor_id in the gate lease, preventing impersonation attacks. CAS hash verification\nprevents artifact tampering - the bundle hash in the receipt must match the actual stored\nartifact. Domain-separated signatures (REVIEW_RECEIPT_RECORDED: prefix) prevent cross-domain\nreplay. Idempotency check prevents duplicate event emission which could confuse downstream\nconsumers. The handler should use constant-time comparison for hash and identity verification\nto prevent timing side-channels.\n"
    }
  }
}
