{
  "schema": "apm2.ticket.v1",
  "ticket_meta": {
    "schema_version": "2026-01-29",
    "template_version": "2026-01-29",
    "ticket": {
      "id": "TCK-00604",
      "title": "FAC core lifecycle state machine refactor and operational hardening",
      "status": "MERGED"
    },
    "binds": {
      "prd_id": "PRD-PLACEHOLDER",
      "rfc_id": "RFC-0019",
      "requirements": [],
      "evidence_artifacts": []
    },
    "custody": {
      "agent_roles": [
        "AGENT_IMPLEMENTER"
      ],
      "responsibility_domains": [
        "DOMAIN_RUNTIME"
      ]
    },
    "dependencies": {
      "tickets": [
        {
          "ticket_id": "TCK-00603",
          "reason": "TCK-00603 introduced inline evidence gates in push.rs without gate-cache reuse."
        }
      ]
    },
    "root_cause_analysis": {
      "summary": "Core FAC lifecycle behavior is currently fragmented and difficult to\nverify end-to-end. There are three major bottlenecks:\n\n1. Gate artifact reuse broken: TCK-00603 added inline evidence gate execution\n   to `apm2 fac push` via `run_evidence_gates()` (the non-caching variant).\n   Previously, push did not run gates inline — the background pipeline handled\n   gates using `run_evidence_gates_with_status()` which checks the gate cache\n   written by `apm2 fac gates`. The result: running `gates` then `push` now\n   double-executes all evidence gates instead of reusing cached results.\n\n2. CI workflow blocks on GitHub projection round-trip: The `forge-admission-cycle.yml`\n   CI workflow's \"Poll review gate\" step polls GitHub issue comments every 30s\n   (up to 80 minutes) waiting for review verdicts to appear as PR comments. The\n   local FAC system already has the verdicts locally (via completion receipts and\n   projection store). The CI workflow creates a hard dependency on the GitHub\n   projection being up-to-date before merge can proceed. If comment publishing\n   fails, is rate-limited, or is slow, the entire merge pipeline stalls — even\n   though the local truth plane already has all necessary evidence.\n\n3. Lifecycle authority is split across multiple ad-hoc CLI paths\n   (`push`, `pipeline`, `restart`, `review run/dispatch/terminate`, and\n   verdict/finding surfaces). This prevents a single formally-verifiable\n   transition model, encourages duplicate transition logic, and makes\n   autonomous implementer/reviewer loops brittle under crashes, SHA drift,\n   and concurrent runs.\n"
    },
    "scope": {
      "in_scope": [
        "Restore gate-cache reuse in `push.rs` so that `apm2 fac push` skips evidence gates already validated by a prior `apm2 fac gates` run for the same SHA.",
        "Ensure the SHA used for cache lookup matches the SHA used for gate execution (no mutation between git push --force and gate evaluation).",
        "Eliminate CI workflow dependency on GitHub comment polling for review verdicts. The self-hosted runner has direct access to local FAC state — use `apm2 fac review verdict show` or local receipt files instead of polling GitHub API for comments.",
        "Suppress daemon auto-start warning on stderr when `--json` output is active (corrupts machine-readable output).",
        "Rename `apm2 fac review comment` to `apm2 fac review finding`. Extend with\nstructured schema fields (--summary, --risk, --impact, --location) beyond the\nexisting --severity and --body. Derive SHA automatically from local PR identity\nso callers don't pass --sha. Findings accumulate locally per PR/type/SHA. When\n`apm2 fac review verdict set` is called, all accumulated findings for that\nPR/type/SHA are concatenated into a single comment and projected to GitHub\n(best effort). Update reviewer prompts to emit one `finding` call per issue\ninstead of a bulk `publish --body-file` markdown file.\n",
        "Fix stale local identity after force-push. Currently, `apm2 fac push`\nwrites the local PR identity/projection BEFORE running gates and\ndispatching reviews. When `git push --force` advances the remote HEAD,\nthe local projection store may hold a SHA that was written prematurely —\nbefore gates validated it and before reviews were dispatched against it.\nSubsequent `apm2 fac restart` then fails with \"local PR identity head\n... is stale relative to authoritative PR head\" with no recovery path.\n\nRequired ordering: local identity/projection update must be the LAST\nstep in the push flow — after git push, after gates pass, after review\ndispatch completes, possibly even after reviews finish. The local SHA\nmust only be persisted once the full pipeline for that SHA has been\nconfirmed. This ensures the local identity always reflects a SHA that\nhas been fully processed, not one that is mid-flight.\n\nAdditionally, `restart` should be able to refresh stale local identity\nfrom the remote when the user explicitly requests recovery, rather than\nhard-failing.\n",
        "Agent concurrency bounding per PR: introduce a tracking module that\nenforces a maximum of 2 concurrent agents working on any single PR at\nany time. The module must:\n(a) Maintain a durable registry of active agent sessions per PR\n    (agent type, PID, start time, SHA being worked).\n(b) Refuse to dispatch new agents when the cap is reached, returning\n    a clear \"at capacity\" signal rather than silently queuing.\n(c) Reap stale entries — detect crashed/killed agents (PID no longer\n    alive) and reclaim their slots automatically.\n(d) Be consulted by all dispatch paths: `fac push` review dispatch,\n    `fac restart`, `fac review run`, and the orchestrator monitor.\nThis prevents infinite loops where reviewers find issues → implementer\npushes fix → new reviewers spawn → find new issues → cycle repeats\nunboundedly with accumulating zombie agents.\n",
        "Create a machine-readable, formally verifiable state machine definition\nfor the entire FAC lifecycle. The state machine must:\n(a) Define every state a PR can be in (e.g. unpushed, pushed,\n    gates-running, gates-passed, gates-failed, reviews-dispatched,\n    review-in-progress, verdict-pending, verdict-approve,\n    verdict-deny, merge-ready, merged, stuck, stale) with precise\n    entry/exit conditions.\n(b) Define every valid transition with its trigger (command, event,\n    timeout), guard conditions, and side effects.\n(c) Be expressed in a structured format (JSON/CAC) that tooling can\n    parse, validate, and render — not prose documentation.\n(d) Be the single source of truth for FAC behavior: implementation\n    changes are driven by updating the state machine first, then\n    working backwards to code. Reviewers and the orchestrator\n    monitor can reference it to understand what should happen next\n    for any given state.\n(e) Include illegal/impossible transitions explicitly so that\n    violations can be detected at runtime (fail-closed on\n    undefined transitions).\n(f) Cover agent lifecycle states (idle, dispatched, running,\n    completed, crashed, reaped) as a sub-machine composed with\n    the PR lifecycle.\n",
        "Use a reducer-first architecture for lifecycle authority. Even before\ndaemon integration, all state transitions must flow through a single\nreducer entrypoint (`apply(state, event) -> next_state | deny`) and\nnever through direct ad-hoc status mutation in command handlers.\n",
        "Explicitly model two composed state machines:\n(a) PR/SHA lifecycle machine (gate/review/merge progression).\n(b) Agent lifecycle machine (spawned/running/completed/crashed/reaped).\nDefine the composition contract for cross-machine transitions\n(e.g. verdict set -> reviewer slot reclaimed -> PR transition).\n",
        "Remove `apm2 fac done` entirely. Verdict is the sole SHA status\nauthority and the only completion signal for reviewer agents.\nSpecifically:\n(a) Delete FacSubcommand::Done and all supporting types\n    (DoneArgs, DoneAgentTypeArg, DoneStatusArg, DoneStatus,\n    CompleteAgentRequest, RunDoneRequest, DoneReceipt) from\n    fac.rs and lifecycle.rs.\n(b) Remove the run_done dispatcher, complete_agent(), and all\n    done-token/done-receipt persistence helpers.\n(c) Remove LifecycleEventKind::AgentDone if no longer referenced\n    by any non-done path.\n(d) Remove all user-facing guidance strings that instruct agents\n    to call `fac done` (push.rs, mod.rs, orchestrator.rs).\n(e) `apm2 fac review verdict set` remains the authoritative\n    completion signal for reviewers. It already reclaims the\n    reviewer's agent registry slot and advances the lifecycle\n    reducer. Non-reviewer agents (implementer, orchestrator)\n    complete via existing orchestration/reap/crash paths.\n(f) Stale agent slots are reclaimed by PID liveness reaping,\n    not by explicit done calls. This eliminates the completion\n    token TTL window where finished agents appear active.\n",
        "Make findings non-authoritative for review status. Findings are\nappend-only evidence records; verdict is the sole source of\nPASS/FAIL decision state. Specifically:\n(a) In findings_store.rs, remove status/verdict mutation from\n    append_dimension_finding() — adding a finding must not set\n    dimension status to FAIL or verdict to FAIL.\n(b) In findings.rs, derive dimension status strictly from\n    verdict projection: verdict PASS → status PASS, verdict\n    FAIL → status FAIL, no verdict → status PENDING.\n(c) overall_status: FAIL if any dimension FAIL, PASS if all\n    active dimensions PASS, PENDING otherwise.\n(d) fail_closed semantics apply only to integrity/validation\n    errors (corrupt bundle, projection mismatch), not to\n    missing verdicts.\n",
        "Comprehensive error handling within the FAC state machine. Every state\nmust define explicit error transitions — no state may silently swallow\nfailures or leave the PR in an undefined limbo. Specifically:\n(a) Agent completes without verdict: a reviewer process exits\n    (or is reaped) without having called `verdict set`. The\n    state machine must detect the missing verdict via PID\n    liveness checks and transition to a recovery state, not\n    assume success.\n(b) Agent stuck/timeout: each agent session has a configurable\n    time bound. If an agent neither sets a verdict nor crashes\n    within the bound, the tracking module marks it stuck, kills\n    it, and transitions the PR to a retriable error state with\n    a bounded retry count.\n(c) API / projection errors: GitHub API failures, rate limits,\n    network timeouts during projection writes. These must be\n    handled as transient errors with exponential backoff and a\n    circuit-breaker. The local truth plane must never block on\n    projection failures — projections are best-effort.\n(d) SHA drift mid-pipeline: a new push arrives while gates or\n    reviews are in progress for an older SHA. The state machine\n    must cancel in-flight work for the stale SHA, reap those\n    agent slots, and restart the pipeline for the new SHA.\n(e) Corrupted / missing state files: HMAC validation failure,\n    missing receipt, partial write. The state machine transitions\n    to a quarantine state requiring explicit operator intervention\n    (`apm2 fac recover`) rather than silently proceeding on\n    broken state.\n(f) Cascading failure prevention: bounded retry counts per state\n    (max 3 by default), global per-PR error budget (max 10 total\n    error transitions before the PR is parked as STUCK requiring\n    manual intervention). No unbounded retry loops.\n",
        "Backwards compatibility and migration requirements:\n(a) Keep a compatibility shim for `apm2 fac review comment` while\n    introducing `apm2 fac review finding`.\n(b) Migrate existing local FAC artifacts and run-state files\n    deterministically (including in-flight runs) with explicit\n    fail-closed behavior on ambiguity/corruption.\n(c) Preserve/normalize legacy terminal reasons and status semantics.\n",
        "Introduce shadow-mode rollout for the new reducer:\n(a) Run current logic and reducer logic in parallel initially.\n(b) Compare projections/terminal outcomes per PR/SHA.\n(c) Block full cutover until divergence is zero across burn-in runs.\n",
        "Add a dedicated runtime recovery command (`apm2 fac recover`) for\nquarantine/ambiguous/corrupt state repair paths defined by the machine.\n",
        "Expand `apm2 fac doctor` to be the unified diagnostic command for\nboth system health AND per-PR lifecycle status. Without `--pr`,\nit retains its current behavior (daemon, disk, token, socket\nchecks). With `--pr <N>`, it produces a comprehensive single-\nsource report for that PR's entire FAC lifecycle. This is the\nONE command an operator or orchestrator agent calls to understand\neverything about a PR. Sections (when --pr is provided):\n\nIDENTITY — \"What PR am I looking at?\"\n(a) PR number, title (from projection cache or local metadata),\n    branch name, worktree path, repo.\n(b) Local SHA vs authoritative remote HEAD SHA.\n    If they differ: flag as STALE with both values.\n    If local identity is missing entirely: flag as MISSING.\n(c) Source and timestamp of the identity record.\n\nLIFECYCLE — \"Where is this PR in the pipeline?\"\n(d) Current reducer state with human-readable label.\n(e) Time in current state (wall-clock duration since last\n    transition).\n(f) Error budget: consumed / max (e.g. \"2/10\").\n(g) Retry budget remaining for current state.\n\nGATES — \"Did evidence gates pass?\"\n(h) Per-gate: name, status (PASS/FAIL/NOT_RUN), duration,\n    SHA they were executed against.\n(i) Cache reusability: whether the cached results are valid\n    for the current HEAD SHA, or stale/missing.\n\nREVIEWS — \"What do the reviewers say?\"\n(j) Per-dimension (security, code-quality):\n    verdict (approve/deny/pending), reviewed SHA, timestamp.\n(k) Findings summary per dimension: blocker/major/minor/nit\n    counts. Full findings via `apm2 fac review findings`.\n(l) Whether findings have been projected to GitHub (and when).\n\nAGENTS — \"Who's working on this PR?\"\n(m) Per-agent entry from the registry: type, state\n    (dispatched/running/completed/crashed/reaped), PID,\n    PID liveness (is the process actually alive right now?),\n    SHA the agent is bound to, run_id, time active.\n(n) Concurrency: active slot count / max (e.g. \"2/2\").\n(o) Any agents with expired completion tokens flagged.\n\nEVENTS — \"What happened recently?\"\n(p) Last N lifecycle events (default 10) with timestamp,\n    event type, SHA, and detail payload.\n\nHEALTH — \"Are there problems?\"\n(q) Actionable diagnostics derived by cross-referencing the\n    sections above. Examples:\n    - \"identity MISSING — run: apm2 fac recover --pr N\n      --refresh-identity\"\n    - \"reviewer-security PID 712345 is dead but slot is\n      still active — will be reaped on next dispatch\"\n    - \"gate cache is stale (cached for abc123, HEAD is\n      def456) — gates will re-run on next push\"\n    - \"security verdict is deny but lifecycle state is\n      verdict_pending — state inconsistency detected\"\n    - \"error budget exhausted (10/10) — PR parked as STUCK\"\n    Each diagnostic includes a severity (info/warning/error)\n    and, where applicable, a suggested remediation command.\n(r) If no problems: explicit \"healthy\" indicator.\n\nOUTPUT MODES\n(s) Default: human-readable sections with headers, aligned\n    columns, and ANSI status indicators.\n(t) --json: single JSON object with all sections as keys,\n    machine-consumable by orchestrator agents.\n(u) Optional --section <name> to show only one section\n    (e.g. --section agents, --section health) for focused\n    queries.\n\nThe command MUST NOT modify any state. It is purely\nobservational. All data sources are read-only.\n"
      ],
      "out_of_scope": [
        "Redesigning the gate cache format or attestation scheme.",
        "Changes to the background pipeline gate execution path.",
        "Removing the CI workflow entirely (it remains the required status check for merge)."
      ]
    },
    "plan": {
      "steps": [
        "Wire gate-cache reuse into push.rs: replace `run_evidence_gates` with cache-aware variant or add cache check in `run_blocking_evidence_gates`.",
        "Validate that SHA captured before `git push --force` matches the SHA used for cache lookup.",
        "Replace the CI workflow's GitHub comment polling with local verdict check: the self-hosted runner can call `apm2 fac review verdict show --json` to read local verdict state directly instead of round-tripping through GitHub API.",
        "Define FAC lifecycle machine artifact format (CAC/JSON), schema id, canonical file location, and validation command.",
        "Implement composed PR/SHA and agent lifecycle reducers with explicit event taxonomy, legal/illegal transition tables, and fail-closed undefined transition handling.",
        "Refactor FAC command handlers to emit reducer events and consume reducer outputs rather than mutating status directly.",
        "Implement durable per-PR agent registry with max-concurrency enforcement (cap=2), stale reaping, and integration across push/restart/review/orchestrator paths.",
        "Remove `apm2 fac done` full stack: CLI surface, lifecycle types, dispatcher, completion-token helpers, done-receipt persistence, and all agent-facing guidance strings.",
        "Make findings non-authoritative: remove status/verdict mutation from findings append path; derive dimension/overall status strictly from verdict projection.",
        "Introduce `apm2 fac review finding` structured interface and staged compatibility shim for `apm2 fac review comment`.",
        "Implement explicit stale identity recovery path in restart/recover flows and enforce projection-update ordering late in push lifecycle.",
        "Implement shadow-mode reducer execution + parity checks, then guarded cutover to reducer authority.",
        "Add fault-injection and crash-recovery tests for SHA drift, lock contention, partial writes, stale PID reuse, projection outage, and corrupted state artifacts.",
        "Run formatting, clippy, docs, and full test suite."
      ]
    },
    "definition_of_done": {
      "evidence_ids": [],
      "criteria": [
        "`apm2 fac gates` followed by `apm2 fac push` (with no intervening changes) reuses cached gate results instead of re-executing all gates.",
        "Gate cache lookup uses the same SHA as gate execution.",
        "CI workflow's review gate uses local FAC verdict state instead of polling GitHub comments.",
        "A machine-readable FAC lifecycle state machine artifact exists, validates against schema, and is treated as single source of truth for FAC transitions.",
        "Reducer enforces legal transitions only; undefined transitions fail closed with machine-readable denial reason.",
        "PR/SHA and agent lifecycle machines are composed and exercised in integration tests.",
        "Per-PR agent cap of 2 is enforced across all dispatch paths with deterministic at-capacity responses.",
        "Stale/dead agent entries are reaped automatically and verified by tests.",
        "`apm2 fac done` is fully removed: no CLI surface, no lifecycle types, no done-receipt paths, no agent guidance strings referencing it.",
        "Adding findings never mutates review status/verdict in storage; `apm2 fac review findings` reports dimension/overall status strictly from verdict state.",
        "Reviewer agent completion is driven by verdict set (reclaims registry slot) and PID reaping (catches crashes); no separate done signal required.",
        "SHA drift during gates/reviews cancels/supersedes stale work and restarts for the newest SHA.",
        "`apm2 fac review finding` is available; legacy `review comment` compatibility path remains functional during migration window.",
        "State migration handles existing local artifacts deterministically; ambiguous/corrupt state paths fail closed and require explicit recover flow.",
        "Shadow-mode parity runs show zero divergence across burn-in threshold before reducer cutover.",
        "Projection failures do not block local truth progression; projection retries/backoff/circuit-breaker behavior is verified.",
        "All evidence gates and tests pass."
      ]
    },
    "notes": {
      "context": "The old push.rs (pre-TCK-00603) did not run evidence gates at all — it was\njust `git push → create PR → auto-merge`. Gates were handled by the background\npipeline via `run_evidence_gates_with_status()` which checks the gate cache.\nTCK-00603 added inline gate execution using `run_evidence_gates()` (no cache),\nbreaking the `gates` → `push` artifact reuse workflow.\n\nThe CI workflow runs on a self-hosted runner (fac-ovh label) which is the same\nVPS that has local FAC state. The \"Poll review gate\" step currently makes ~160\nGitHub API calls per PR (80 min / 30s interval × 2 dimensions) when it could\nread the verdict from a local file in one call.\n\nFAC is the system's core execution spine. This ticket intentionally combines\noperational fixes with architectural unification so lifecycle behavior becomes\nexplicit, reducer-driven, and formally checkable before daemon integration.\n"
    }
  }
}
