{
  "schema": "apm2.ticket.v1",
  "ticket_meta": {
    "schema_version": "2026-01-29",
    "template_version": "2026-01-29",
    "ticket": {
      "id": "TCK-00488",
      "title": "Authoritative boundary-flow leakage and timing witnesses with fail-closed admission",
      "status": "CLOSED"
    },
    "binds": {
      "prd_id": "PRD-0010",
      "rfc_id": "RFC-0028",
      "requirements": [
        {
          "requirement_id": "REQ-0004",
          "requirement_ref": "documents/rfcs/RFC-0028/requirements/REQ-0004.yaml#requirement"
        }
      ],
      "evidence_artifacts": [
        {
          "evidence_id": "EVID-0005",
          "artifact_ref": "documents/rfcs/RFC-0028/evidence_artifacts/EVID-0005.yaml#evidence_artifact"
        }
      ]
    },
    "custody": {
      "agent_roles": [
        "AGENT_IMPLEMENTER",
        "AGENT_REVIEWER"
      ],
      "responsibility_domains": [
        "DOMAIN_SECURITY",
        "DOMAIN_RUNTIME",
        "DOMAIN_OBSERVABILITY"
      ]
    },
    "dependencies": {
      "tickets": [
        {
          "ticket_id": "TCK-00465",
          "reason": "Boundary-flow integrity defines the leakage/timing budget types; this ticket provides authoritative evidence sources."
        },
        {
          "ticket_id": "TCK-00486",
          "reason": "Policy-root isolation ensures boundary-flow policy is authoritatively sourced before evidence can be evaluated against it."
        }
      ]
    },
    "scope": {
      "in_scope": [
        "Problem: authoritative leakage/timing witness providers always return None (stubbed). Strict mode degrades to monitor-only when witnesses are absent. Monitor-only accepts client-provided hints or synthesizes permissive defaults (leakage_bits=0, observed_variance_ticks=0). Effectively fail-open for all boundary-enforced tool classes.",
        "Implement authoritative leakage witness provider: daemon-instrumented measurement of actual information leakage at boundary crossings (byte counts, entropy estimates, or equivalent metrics). NOT client-reported.",
        "Implement authoritative timing witness provider: daemon-instrumented measurement of timing variance at boundary crossings. NOT client-reported.",
        "Remove monitor-only fallback for boundary-enforced tool classes: missing authoritative witnesses must deny, not degrade to permissive defaults.",
        "Remove permissive synthetic defaults (leakage_bits=0, observed_variance_ticks=0) for enforcement tiers.",
        "Integrate with PCAC: boundary-flow evidence digests included in AJC join input so missing evidence is a join-time deny.",
        "Preserve non-strict mode for Tier0-Tier1 with explicit waiver binding and defect emission."
      ],
      "out_of_scope": [
        "Quarantine eviction policy (TCK-00489).",
        "Declassification receipt single-use (TCK-00485).",
        "Cross-cell boundary-flow policy."
      ]
    },
    "plan": {
      "steps": [
        "Design authoritative leakage measurement interface: what does the daemon measure at boundary crossings? Define LeakageWitnessV1 schema with measurement_method, measured_bits, confidence, timestamp.",
        "Design authoritative timing measurement interface: define TimingWitnessV1 schema with measurement_method, observed_variance_ticks, baseline_ticks, confidence, timestamp.",
        "Implement daemon-side measurement hooks at boundary crossing points (tool actuation, context compilation, evidence publish).",
        "Wire authoritative providers: replace stub None-returning providers with actual measurement-backed providers.",
        "Remove monitor-only fallback for enforcement tiers: missing witnesses → deny.",
        "Integrate with PCAC join: include leakage_witness_hash and timing_witness_hash in boundary-flow AJC input.",
        "Add tests: (a) missing authoritative witnesses denied (not degraded to monitor-only), (b) client-provided hints rejected for enforcement tiers, (c) measured leakage above budget triggers quarantine, (d) measured timing variance above budget triggers quarantine, (e) Tier0-Tier1 non-strict mode with waiver.",
        "Run mandatory pre-commit checks."
      ]
    },
    "definition_of_done": {
      "evidence_ids": [
        "EVID-0005"
      ],
      "criteria": [
        "Authoritative leakage and timing witnesses are daemon-instrumented, not client-reported.",
        "Missing witnesses deny for enforcement tiers (no monitor-only fallback).",
        "Permissive synthetic defaults (leakage_bits=0, observed_variance_ticks=0) eliminated for enforcement tiers.",
        "PCAC join input includes boundary-flow evidence digests.",
        "Boundary-enforced tool classes can succeed positive-path with authoritative witnesses."
      ]
    },
    "notes": {
      "security": "PCAC helps here but doesn't solve it alone. PCAC gates on evidence presence (fail-closed\nwhen join input is missing evidence hashes), but it can't produce the evidence. The daemon\nmust actually MEASURE leakage and timing at boundary crossings. The current stub providers\nreturning None are the root cause of the fail-open behavior.\n\nThe critical invariant: boundary-flow admission MUST be based on daemon-authoritative\nmeasurements, never client-reported hints. Client hints are routing facts; daemon measurements\nare acceptance facts.\n",
      "verification": "Adversarial test: send boundary-flow hints with leakage_bits=0 and observed_variance_ticks=0\nwhile actual daemon measurements show non-zero values. Verify that daemon measurements\nprevail and client hints are ignored for enforcement decisions.\n"
    }
  }
}
