{
  "schema": "apm2.ticket.v1",
  "ticket_meta": {
    "schema_version": "2026-01-29",
    "template_version": "2026-01-29",
    "ticket": {
      "id": "TCK-00388",
      "title": "Gate execution orchestrator: autonomous gate lifecycle after session termination",
      "status": "CLOSED"
    },
    "binds": {
      "prd_id": "PRD-0009",
      "rfc_id": "RFC-0018"
    },
    "custody": {
      "agent_roles": [
        "AGENT_IMPLEMENTER"
      ],
      "responsibility_domains": [
        "DOMAIN_RUNTIME",
        "DOMAIN_ORCHESTRATION"
      ]
    },
    "dependencies": {
      "tickets": [
        {
          "ticket_id": "TCK-00383",
          "reason": "CAS and broker wiring must be operational for gate lease emission and receipt storage."
        }
      ]
    },
    "scope": {
      "in_scope": [
        "Implement GateOrchestrator module in daemon that watches for session_terminated ledger events.",
        "For each terminated session with associated work, resolve policy via PolicyResolvedForChangeSet.",
        "Issue GateLeaseIssued events for each required gate (aat, quality, security).",
        "Spawn gate executor episodes using agent adapter profiles from builtin_profiles.",
        "Collect GateReceipt results from gate executors and emit to ledger.",
        "Implement gate timeout with fail-closed semantics (expired leases block merge).",
        "Wire GateOrchestrator into daemon main loop as a background task."
      ],
      "out_of_scope": [
        "Gate execution business logic (quality/security review prompts are reviewer concerns).",
        "xtask cutover from external Gemini spawning (TCK-00324, separate concern).",
        "Merge automation after gate approval (TCK-00390).",
        "Review receipt ingestion endpoint (TCK-00389)."
      ]
    },
    "plan": {
      "steps": [
        "Create GateOrchestrator struct in crates/apm2-daemon/src/gate/ with ledger tailer for session_terminated events.",
        "On session_terminated: look up associated work_id and changeset_digest from session state.",
        "Resolve policy for the changeset using PolicyResolvedForChangeSetBuilder, emit PolicyResolvedForChangeSet event.",
        "For each gate type (aat, quality, security): build GateLease via GateLeaseBuilder, sign with daemon signer, emit GateLeaseIssued event.",
        "Spawn bounded execution episodes via EpisodeRuntime for each gate, using appropriate agent adapter profile.",
        "Monitor spawned episodes for completion or timeout; collect GateReceipt or AatGateReceipt results.",
        "Emit gate_receipt events to ledger for each completed gate.",
        "On gate timeout: emit GateReceipt with FAIL verdict and close the lease (fail-closed).",
        "Add integration test: terminate a session, verify GateOrchestrator emits policy resolution, leases, and receipts."
      ]
    },
    "definition_of_done": {
      "criteria": [
        "Session termination with associated work triggers autonomous gate lifecycle.",
        "PolicyResolvedForChangeSet event is emitted before any GateLeaseIssued event (ordering invariant).",
        "GateLeaseIssued events are emitted for aat, quality, and security gate types.",
        "Gate executor episodes are spawned using EpisodeRuntime with correct agent adapter profiles.",
        "GateReceipt events are emitted to ledger upon gate completion.",
        "Gate timeout produces fail-closed FAIL verdict, not silent expiry.",
        "All gate leases use domain-separated Ed25519 signatures (GATE_LEASE_ISSUED: prefix).",
        "Integration test validates full gate lifecycle from session_terminated to gate_receipt."
      ]
    },
    "notes": {
      "context": "The FAC state machine requires: session_terminated -> RUN_GATES -> gate_receipt -> AWAIT_REVIEW.\nCurrently, gates are spawned by xtask as external Gemini CLI processes (xtask/src/tasks/push.rs\nline 243+), which creates PENDING GitHub status checks and spawns background Gemini processes\noutside the FAC pipeline. This means gate execution is not tracked in the ledger, leases are\nnot issued, and receipts are not cryptographically bound.\n\nThe core FAC types already exist:\n- GateLease with domain-separated Ed25519 signatures (GATE_LEASE_ISSUED: prefix)\n- GateReceipt versioned envelope for recording gate outcomes\n- AatGateReceipt for AAT-specific gate results\n- PolicyResolvedForChangeSet as the anchor event that must precede all lease issuance\n- Agent adapter profiles (Claude Code, Gemini CLI, Codex CLI) for spawning gate executors\n\nThe episode runtime (EpisodeRuntime in crates/apm2-daemon/src/episode/mod.rs) already supports\nspawning bounded execution episodes with lifecycle management (CREATED -> RUNNING -> TERMINATED).\nThe session module (crates/apm2-daemon/src/session/consume.rs) already handles SessionTerminated\nevents. The gap is that no daemon component watches for session termination and orchestrates\nthe gate lifecycle in response.\n\nThe GateOrchestrator must enforce the PolicyResolvedForChangeSet ordering invariant: a policy\nresolution MUST exist before any GateLeaseIssued event for the same work_id/changeset. This\nis critical for security - it prevents policy downgrade attacks where gates run under a\nweaker policy than intended.\n",
      "files": "- crates/apm2-core/src/fac/lease.rs (GateLease, GateLeaseBuilder with Ed25519 domain-separated signatures)\n- crates/apm2-core/src/fac/receipt.rs (GateReceipt versioned envelope)\n- crates/apm2-core/src/fac/aat_receipt.rs (AatGateReceipt for AAT gate results)\n- crates/apm2-core/src/fac/policy_resolution.rs (PolicyResolvedForChangeSet anchor event)\n- crates/apm2-core/src/fac/builtin_profiles.rs (agent adapter profiles: Claude Code, Gemini CLI, Codex CLI)\n- crates/apm2-daemon/src/episode/mod.rs (EpisodeRuntime for spawning bounded execution episodes)\n- crates/apm2-daemon/src/session/consume.rs (SessionTerminated event handling)\n- crates/apm2-daemon/src/episode/broker.rs (episode broker dispatches session_terminated)\n- xtask/src/tasks/push.rs (current external gate spawning at line 243+, to be superseded)\n",
      "security": "Gate leases MUST use domain-separated Ed25519 signatures to prevent cross-domain replay.\nThe PolicyResolvedForChangeSet ordering invariant is security-critical: violating it allows\npolicy downgrade attacks. Gate timeout MUST be fail-closed (expired gate = FAIL verdict),\nnot fail-open (expired gate = implicit PASS). The GateOrchestrator must validate that the\nchangeset_digest in each lease matches the actual changeset from the terminated session,\npreventing substitution attacks. All gate receipts must be signed by the executor bound\nin the lease - receipt from a different executor must be rejected.\n"
    }
  }
}
