{
  "principles": [
    {
      "corollaries": [
        "A missing context input is a compiler failure, not an execution-time discovery obligation.",
        "Optimizing the innermost loop is primarily optimizing context completeness and correctness."
      ],
      "id": "CAC-P-PRIN-0001",
      "name": "Context is the program",
      "statement": "Normative context artifacts are the source program; code and other outputs are compiled artifacts."
    },
    {
      "id": "CAC-P-PRIN-0002",
      "name": "Machine-native, canonical, validated",
      "statement": "Every normative artifact is machine-readable, schema-validated, and canonicalized to stable bytes before it can influence behavior."
    },
    {
      "id": "CAC-P-PRIN-0003",
      "name": "Patch-first authoring",
      "statement": "Machines author changes as small, typed, replay-protected patches; whole-document rewrites are an anti-pattern."
    },
    {
      "id": "CAC-P-PRIN-0004",
      "name": "Hermetic consumption, bounded production",
      "statement": "ZTI applies to context consumption: no discretionary context discovery; production may use tools under explicit leases/budgets with replayable evidence."
    },
    {
      "id": "CAC-P-PRIN-0005",
      "name": "Evidence is mandatory",
      "statement": "Every admission, compilation, export, and gate decision produces evidence stored in CAS and referenced by signed ledger events."
    },
    {
      "corollaries": [
        "No direct edits to generated ABI trees in mainline.",
        "Delivery conformance is tested and versioned via target profiles."
      ],
      "id": "CAC-P-PRIN-0006",
      "name": "Target profiles are the ABI contract",
      "statement": "Rendering, retrieval, and delivery are governed by target profiles; vendor or model-specific payloads are deterministic projections, never normative sources."
    },
    {
      "id": "CAC-P-PRIN-0007",
      "name": "Fail-closed, least privilege, algorithm agility",
      "statement": "Parsing, validation, and policy checks fail closed; privileges are explicit; cryptography and serialization choices remain agile under an adversarial threat model."
    },
    {
      "id": "CAC-P-PRIN-0008",
      "name": "Message-level provenance and replay",
      "statement": "All state transitions are represented as signed kernel messages referencing immutable hashes; projections are derived, reconstructable, and auditable."
    },
    {
      "corollaries": [
        "All transitive dependencies are resolved and pinned before consumption.",
        "ContextPack manifests are closure views over the context graph."
      ],
      "id": "CAC-P-PRIN-0009",
      "name": "Context graph closure",
      "statement": "Dependencies are explicit and closed; hermetic consumption operates on deep-pinned graph closures, not open-ended discovery."
    },
    {
      "id": "CAC-P-PRIN-0010",
      "name": "Typed, bounded quantities",
      "statement": "Budgets, timeouts, costs, and probabilities use typed quantities with explicit units and enforced bounds to ensure deterministic cross-language behavior."
    }
  ]
}
