{
  "schema": "apm2.security.secrets_management_doc.v1",
  "schema_version": "1.0.0",
  "kind": "security.secrets_management_document",
  "meta": {
    "stable_id": "dcp://apm2.security/doc/secrets-management@1",
    "status": "ACTIVE",
    "classification": "INTERNAL",
    "source_of_truth_refs": [
      "documents/rfcs/RFC-0020/HOLONIC_SUBSTRATE_INTERFACE.md",
      "documents/security/SECURITY_POLICY.cac.json",
      "documents/security/INCIDENT_RESPONSE.cac.json"
    ],
    "last_aligned_rfc": "RFC-0020",
    "replaces": "documents/security/SECRETS_MANAGEMENT.md",
    "created_at": "2026-02-05T00:00:00Z",
    "updated_at": "2026-02-05T00:00:00Z",
    "canonicalizer": {
      "canonicalizer_id": "apm2.canonicalizer.jcs",
      "canonicalizer_version": "1.0.0",
      "vectors_ref": "dcp://apm2.cac/canonicalizer/vectors@v1"
    },
    "provenance": {
      "actor_id": "HOLON-SECURITY-GOVERNANCE",
      "work_id": "DOC-SECURITY-RFC0020-ALIGN-20260205",
      "source_receipts": []
    }
  },
  "payload": {
    "objective": "Maintain credential confidentiality, least-privilege usage, auditability, and supply-chain isolation through mechanical controls that prevent leakage into source, logs, artifacts, and uncontrolled stores.",
    "authoritative_runtime_semantics": "RFC-0020 is authoritative for confidentiality and integrity labeling, context firewall behavior, and fail-closed handling on high-risk authority paths.",
    "compliance_mappings": [
      {
        "framework": "OWASP Top 10",
        "control_refs": [
          "A02:2021"
        ],
        "mapping_statement": "Treat confidentiality failures (including secret leakage via source/logs/artifacts) as primary risk and enforce layered prevention and redaction."
      },
      {
        "framework": "CIS Controls",
        "control_refs": [
          "Control 3"
        ],
        "mapping_statement": "Systematically manage sensitive data boundaries, storage, access, and monitoring across runtime and CI domains."
      },
      {
        "framework": "SLSA",
        "control_refs": [
          "L3"
        ],
        "mapping_statement": "Isolate secrets to controlled build environments and avoid embedding secrets in source or durable artifacts."
      }
    ],
    "threat_posture": [
      "Secret exposure is assumed high-impact and operationally likely unless prevented by hard controls.",
      "Secret leakage is treated as a supply-chain vulnerability, not merely application correctness debt.",
      "Control design prioritizes blast-radius reduction by custody domain segmentation."
    ],
    "layered_prevention_model": [
      {
        "order": 1,
        "statement": "Prohibit secrets in repository content."
      },
      {
        "order": 2,
        "statement": "Store long-lived secrets only in platform secure stores."
      },
      {
        "order": 3,
        "statement": "Inject secrets only at runtime and only to required process scopes."
      },
      {
        "order": 4,
        "statement": "Apply mandatory redaction to outbound text channels."
      },
      {
        "order": 5,
        "statement": "Scan persistence and release surfaces before write or publish operations."
      }
    ],
    "secret_classes": [
      {
        "class_id": "SECRET-CLASS-01",
        "name": "Runtime user credentials",
        "custody_boundary": "Host OS secure storage and daemon-mediated retrieval.",
        "storage_location": "OS keyring (macOS Keychain, Windows Credential Manager, Linux Secret Service).",
        "forbidden_locations": [
          "Repository plaintext files",
          "Application config plaintext",
          "Uncontrolled local files"
        ]
      },
      {
        "class_id": "SECRET-CLASS-02",
        "name": "CI/CD secrets",
        "custody_boundary": "Controlled build environment only.",
        "storage_location": "GitHub Actions secrets and runtime-injected workflow environment.",
        "forbidden_locations": [
          "Developer machines",
          "Repository source",
          "Build logs"
        ]
      },
      {
        "class_id": "SECRET-CLASS-03",
        "name": "Release signing private keys",
        "custody_boundary": "Not part of long-lived secret inventory.",
        "storage_location": "Eliminated by Sigstore keyless signing model.",
        "forbidden_locations": [
          "Repository key files",
          "CI key vault artifacts",
          "Operator key escrow"
        ]
      }
    ],
    "runtime_storage_controls": [
      "Use apm2-core credential management backed by host OS keyring encryption and access mediation.",
      "Do not re-implement custom cryptographic secret storage in application code.",
      "Treat runtime credentials (API keys, OAuth/session tokens) as high-value and lifecycle-managed assets."
    ],
    "in_memory_controls": [
      "Use secrecy::SecretString rather than String for sensitive material.",
      "Require explicit ExposeSecret at point-of-use.",
      "Rely on best-effort zeroization on drop to reduce residual memory lifetime.",
      "Avoid accidental disclosure through debug formatting and cloning paths."
    ],
    "distribution_controls": [
      "Use on-demand secret retrieval and environment-variable injection via apm2-daemon.",
      "Bind injected secrets to specific managed process instances.",
      "Do not pass secrets via command-line arguments visible in process listings.",
      "Limit propagation by process boundary and scoped runtime injection."
    ],
    "labeling_and_taint_controls": [
      "Carry classification and taint metadata on secret-bearing flows when possible.",
      "Enforce confidentiality ceilings and integrity floors at boundary emissions.",
      "Tier2+ and Tier3+ paths fail closed when trust or freshness state is ambiguous."
    ],
    "logging_and_artifact_controls": [
      "Route logs through SecretRedactor.",
      "Automatically redact sensitive environment variable patterns including *_KEY, *_TOKEN, *_SECRET, *_PASSWORD, and cloud/provider prefixes.",
      "Apply redaction to runtime logs, API response bodies, errors, and other textual channels.",
      "Treat build artifacts and logs as durable exfiltration channels requiring hard controls."
    ],
    "pre_persistence_scanning": [
      "Scan file writes, build outputs, and release artifacts for secret material before persistence or publication.",
      "Treat scans as mandatory defense-in-depth, not optional linting.",
      "Pair scanning with release signing and provenance to prevent securely signed but secret-leaking artifacts."
    ],
    "ci_cd_controls": [
      "Inject CI secrets only at job runtime and only to jobs that require them.",
      "Avoid command options that echo tokens; use silent modes where applicable.",
      "Treat any step capable of exposing secrets as security-critical.",
      "Do not embed CI secrets in source, generated files, or artifact metadata."
    ],
    "rotation_policy": [
      "Apply periodic rotation targets (for example, 90-day token rotation for publish credentials).",
      "Trigger immediate rotation on suspected compromise.",
      "Coordinate rotation with incident-response containment timelines."
    ],
    "keyless_signing_boundary": [
      "Eliminate long-lived signing private keys from secrets inventory via Sigstore keyless model.",
      "Use workload identity (OIDC), short-lived certificates, and transparency logs for release signing trust.",
      "Treat keyless release signing as distinct from runtime authority authentication semantics."
    ],
    "incident_response_sequence": [
      {
        "order": 1,
        "statement": "Revoke exposed credentials immediately."
      },
      {
        "order": 2,
        "statement": "Rotate related credentials to reduce attacker dwell time."
      },
      {
        "order": 3,
        "statement": "Audit for misuse and unauthorized access."
      },
      {
        "order": 4,
        "statement": "Remediate repository and artifact history when applicable."
      },
      {
        "order": 5,
        "statement": "Document root cause, timeline, and preventive actions."
      }
    ],
    "local_testing_controls": [
      "CI uses GitHub Actions secrets with least-privilege job scoping.",
      "Local .env files are allowed only when gitignored, never committed, and loaded through controlled mechanisms.",
      "Prevent test convenience from creating shadow secret stores."
    ],
    "summary_invariants": [
      "No plaintext repository secret storage.",
      "No secret leakage in logs, errors, or artifacts.",
      "Platform-backed runtime storage and controlled CI secret custody.",
      "Prescriptive incident handling for any suspected leak regardless of proven exploitation.",
      "Automatable controls prioritized over advisory guidance."
    ],
    "scale_profile": {
      "capacity_target": "multi-exabyte",
      "high_volume_controls": [
        "Use digest-addressed evidence and targeted retrieval for leak investigations at scale.",
        "Apply deterministic redaction policies in high-throughput logging pipelines.",
        "Bound scanner workloads and enforce fail-closed publish behavior on scan ambiguity.",
        "Preserve verifiable telemetry for forensic reconstruction without raw context over-propagation."
      ]
    },
    "cryptography_posture": {
      "pqc_status": "DEFERRED",
      "pqc_note": "PQC migration is deferred; current secret controls align to active RFC-0020 trust semantics and Sigstore keyless release posture."
    }
  }
}
